SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-1.0.0/boards.txt
### BOD MODE
lite.menu.bodmode.disabled=Disabled/Disabled
lite.menu.bodmode.enabled=Enabled/Enabled
lite.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
lite.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
lite.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
lite.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
lite.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
lite.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
lite.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
lite.menu.bodmode.disabled.bootloader.BODCFG=0x00
lite.menu.bodmode.enabled.bootloader.bodmodebits=00101
lite.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
lite.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
lite.menu.bodmode.samplefast.bootloader.bodmodebits=01010
lite.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
lite.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
lite.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
lite.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### VOLTAGE FOR UART BAUD CORRECTION
lite.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
lite.menu.uartvoltage.skip.build.uartvoltage=NA
lite.menu.uartvoltage.5v=Closer to 5v
lite.menu.uartvoltage.5v.build.uartvoltage=5V
lite.menu.uartvoltage.3v=Closer to 3v
lite.menu.uartvoltage.3v.build.uartvoltage=3V

### BOOTLOADER UART PINS
lite.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
lite.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
lite.menu.bootloaderuart.default.bootloader.uartswap=
lite.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
lite.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
lite.menu.resetpinopti.UPDI.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
lite.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
lite.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
lite.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txyz{bootloader.uartswap}_1sec.hex
lite.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
lite.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
lite.menu.resetpinopti.reset.bootloader.file=optiboot_txyz{bootloader.uartswap}_rst.hex
lite.menu.resetpinopti.reset.bootloader.resetpinbits=10
lite.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
lite.menu.resetpinopti.gpio.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
lite.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
lite.menu.startuptimeopti.8=8ms
lite.menu.startuptimeopti.0=0ms
lite.menu.startuptimeopti.1=1ms
lite.menu.startuptimeopti.2=2ms
lite.menu.startuptimeopti.4=4ms
lite.menu.startuptimeopti.16=16ms
lite.menu.startuptimeopti.32=32ms
lite.menu.startuptimeopti.64=64ms
lite.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
lite.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
lite.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
lite.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
lite.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
lite.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
lite.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
lite.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07



#########################################################

prod.build.text_section_start=.text=0x0
prod.build.millistimer=D0
prod.build.bootload=
prod.build.board=AVR_ATtinyxy4
prod.build.clocksource=0
prod.build.clocksource=0
prod.build.core=megatinycore
prod.build.variant=txy4
prod.build.tuned=
prod.build.printf=
prod.build.wire=MORS
prod.build.attachmode=-DCORE_ATTACH_ALL
prod.build.mcu=attiny{build.attiny}
prod.build.f_cpu={build.speed}000000L
prod.build.extra_flags=-DARDUINO_attinyxy4 {build.tuned}
prod.build.export_merged_output=false

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
prod.bootloader.WDTCFG=0x00
prod.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
prod.bootloader.OSCCFG=0x01
prod.bootloader.TCD0CFG_avrdude=
prod.bootloader.TCD0CFG_serialupdi=
prod.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
prod.bootloader.APPEND=0x00
prod.bootloader.BOOTEND=0x00
prod.bootloader.resetpinbits=01
prod.bootloader.avrdudestring=
prod.bootloader.serialupdistring=-aerase
prod.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
prod.build.bootload=
prod.build.printfabr=
prod.build.attachabr=
prod.build.wireabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
prod.upload.tool=avrdude
prod.upload.workaround=
prod.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#

prod.menu.chip.404=ATtiny404
prod.menu.chip.404.build.board=AVR_ATtiny404
prod.menu.chip.404.build.attiny=404
prod.menu.chip.404.build.millistimer=A0
prod.menu.chip.404.upload.maximum_size=4096
prod.menu.chip.404.upload.maximum_data_size=256

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
prod.menu.clock.20internal=20 MHz internal
prod.menu.clock.16internal=16 MHz internal
prod.menu.clock.10internal=10 MHz internal
prod.menu.clock.8internal=8 MHz internal
prod.menu.clock.5internal=5 MHz internal
prod.menu.clock.4internal=4 MHz internal
prod.menu.clock.1internal=1 MHz internal
prod.menu.clock.20internaltuned=20 MHz internal - tuned
prod.menu.clock.16internaltuned=16 MHz internal - tuned
prod.menu.clock.12internaltuned=12 MHz internal - tuned
prod.menu.clock.20extclock=20 MHz external clock
prod.menu.clock.16extclock=16 MHz external clock
prod.menu.clock.12extclock=12 MHz external clock
prod.menu.clock.10extclock=10 MHz external clock
prod.menu.clock.8extclock=8 MHz external clock
prod.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
prod.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
prod.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
prod.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
prod.menu.clock.24extclock=24 MHz external clock - overclocked
prod.menu.clock.25extclock=25 MHz external clock - overclocked
prod.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
prod.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
prod.menu.clock.20internal.build.speed=20
prod.menu.clock.20internal.build.clocksource=0
prod.menu.clock.16internal.build.speed=16
prod.menu.clock.16internal.build.clocksource=0
prod.menu.clock.10internal.build.speed=10
prod.menu.clock.10internal.build.clocksource=0
prod.menu.clock.8internal.build.speed=8
prod.menu.clock.8internal.build.clocksource=0
prod.menu.clock.5internal.build.speed=5
prod.menu.clock.5internal.build.clocksource=0
prod.menu.clock.4internal.build.speed=4
prod.menu.clock.4internal.build.clocksource=0
prod.menu.clock.1internal.build.speed=1
prod.menu.clock.1internal.build.clocksource=0
prod.menu.clock.20extclock.build.speed=20
prod.menu.clock.20extclock.build.clocksource=2
prod.menu.clock.16extclock.build.speed=16
prod.menu.clock.16extclock.build.clocksource=2
prod.menu.clock.12extclock.build.speed=12
prod.menu.clock.12extclock.build.clocksource=2
prod.menu.clock.10extclock.build.speed=10
prod.menu.clock.10extclock.build.clocksource=2
prod.menu.clock.8extclock.build.speed=8
prod.menu.clock.8extclock.build.clocksource=2
prod.menu.clock.24extclock.build.speed=24
prod.menu.clock.24extclock.build.clocksource=2
prod.menu.clock.25extclock.build.speed=24
prod.menu.clock.25extclock.build.clocksource=2
prod.menu.clock.30extclock.build.speed=30
prod.menu.clock.30extclock.build.clocksource=2
prod.menu.clock.32extclock.build.speed=32
prod.menu.clock.32extclock.build.clocksource=2
prod.menu.clock.20internaltuned.build.speed=20
prod.menu.clock.20internaltuned.build.clocksource=0
prod.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.16internaltuned.build.speed=16
prod.menu.clock.16internaltuned.build.clocksource=0
prod.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.12internaltuned.build.speed=12
prod.menu.clock.12internaltuned.build.clocksource=0
prod.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.24internaltuned.build.speed=24
prod.menu.clock.24internaltuned.build.clocksource=0
prod.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.25internaltuned.build.speed=25
prod.menu.clock.25internaltuned.build.clocksource=0
prod.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.30internaltuned.build.speed=30
prod.menu.clock.30internaltuned.build.clocksource=0
prod.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.32internaltuned.build.speed=32
prod.menu.clock.32internaltuned.build.clocksource=0
prod.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
prod.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
prod.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
prod.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
prod.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
prod.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
prod.menu.clock.20internal.bootloader.OSCCFG=0x02
prod.menu.clock.10internal.bootloader.OSCCFG=0x02
prod.menu.clock.5internal.bootloader.OSCCFG=0x02

