SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-1.0.0/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
prod.menu.bodvoltage.1v8=1.8V (5 MHz or less)
prod.menu.bodvoltage.2v6=2.6V (10 MHz or less)
prod.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
prod.menu.bodvoltage.2v1=2.1V (Unofficial)
prod.menu.bodvoltage.2v9=2.9V (Unofficial)
prod.menu.bodvoltage.3v3=3.3V (Unofficial)
prod.menu.bodvoltage.3v7=3.7V (Unofficial)
prod.menu.bodvoltage.4v0=4.0V (Unofficial)
prod.menu.bodvoltage.1v8.bootloader.bodlevbits=000
prod.menu.bodvoltage.2v1.bootloader.bodlevbits=001
prod.menu.bodvoltage.2v6.bootloader.bodlevbits=010
prod.menu.bodvoltage.2v9.bootloader.bodlevbits=011
prod.menu.bodvoltage.3v3.bootloader.bodlevbits=100
prod.menu.bodvoltage.3v7.bootloader.bodlevbits=101
prod.menu.bodvoltage.4v0.bootloader.bodlevbits=110
prod.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
prod.menu.bodmode.disabled=Disabled/Disabled
prod.menu.bodmode.enabled=Enabled/Enabled
prod.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
prod.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
prod.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
prod.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
prod.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
prod.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
prod.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
prod.menu.bodmode.disabled.bootloader.BODCFG=0x00
prod.menu.bodmode.enabled.bootloader.bodmodebits=00101
prod.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
prod.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
prod.menu.bodmode.samplefast.bootloader.bodmodebits=01010
prod.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
prod.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
prod.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
prod.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
prod.menu.eesave.enable=EEPROM retained
prod.menu.eesave.enable.bootloader.eesavebit=1
prod.menu.eesave.disable=EEPROM not retained
prod.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
prod.menu.millis.enabled=Enabled (default timer)
prod.menu.millis.disabled=Disabled (saves flash)
prod.menu.millis.timera=TCA0 (default on 0-series)
prod.menu.millis.timerd=TCD0 (1-series only, default there)
prod.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
prod.menu.millis.timerb1=TCB1 (1614, 2-series only)
prod.menu.millis.rtc=RTC (no micros)
prod.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
prod.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only no micros)
prod.menu.millis.disabled.build.millistimer=NONE
prod.menu.millis.timera.build.millistimer=A0
prod.menu.millis.timerd.build.millistimer=D0
prod.menu.millis.timerb0.build.millistimer=B0
prod.menu.millis.timerb1.build.millistimer=B1
prod.menu.millis.rtc.build.millistimer=RTC
prod.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
prod.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#prod.menu.resetpin.UPDI=UPDI (no reset pin)
#prod.menu.resetpin.UPDI.bootloader.resetpinbits=01
#prod.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#prod.menu.resetpin.reset.bootloader.resetpinbits=10
#prod.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#prod.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
prod.menu.startuptime.8=8ms
prod.menu.startuptime.0=0ms
prod.menu.startuptime.1=1ms
prod.menu.startuptime.2=2ms
prod.menu.startuptime.4=4ms
prod.menu.startuptime.16=16ms
prod.menu.startuptime.32=32ms
prod.menu.startuptime.64=64ms
prod.menu.startuptime.0.bootloader.SYSCFG1=0x00
prod.menu.startuptime.1.bootloader.SYSCFG1=0x01
prod.menu.startuptime.2.bootloader.SYSCFG1=0x02
prod.menu.startuptime.4.bootloader.SYSCFG1=0x03
prod.menu.startuptime.8.bootloader.SYSCFG1=0x04
prod.menu.startuptime.16.bootloader.SYSCFG1=0x05
prod.menu.startuptime.32.bootloader.SYSCFG1=0x06
prod.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
prod.menu.wiremode.mors=Master or Slave (saves flash and RAM)
prod.menu.wiremode.mors.build.wire=MORS
prod.menu.wiremode.mands=Master and Slave
prod.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
prod.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
prod.menu.printf.full=Full, 2.6k, prints floats
prod.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
prod.menu.printf.full.build.printfabr=.pfF
prod.menu.printf.minimal=Minimal, 1.1k flash used
prod.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
prod.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
prod.menu.attach.allenabled=On all pins, like usual
prod.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
prod.menu.attach.manual=Only enabled ports. Please see documentation.
prod.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
prod.menu.attach.oldversion=Old version, (may fix bugs)
prod.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
prod.menu.attach.manual.build.attachabr=.aMan
prod.menu.attach.oldversion.build.attachabr=.aOld
